actuator/NS-DBD/fvOptions_expDecay/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatSource
{
    type            scalarSemiImplicitSource;
    active          true;
 
    scalarSemiImplicitSourceCoeffs
    {
        timeStart       0;
        duration        350.0e-9;
        selectionMode   cellSet; // all, cellSet, cellZone, points
       // cellZone        heatSrc;
        //cellSet         laser;
        cellSet         plasmaHeating;
        volumeMode      specific; //absolute;  
        injectionRateSuSp
        {
            e     (2.65e08 0);
        }
    }
}

// ************************************************************************* //
